#Реализовать формирование списка, используя функцию range() и возможности генератора.
#В список должны войти четные числа от 100 до 1000 (включая границы).
#Необходимо получить результат вычисления произведения всех элементов списка.


from functools import reduce


def my_func(f_el, s_el):
    return f_el * s_el

a = [i for i in range(100, 1000 + 1) if i % 2 == 0]
b = reduce(my_func, [i for i in range(100, 1000 + 1) if i % 2 == 0])


print(f'Список четных значений {a}')
print(f'Результат перемножения всех элементов списка {b}')